Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་འཇིག་རྟེན་ཕན་པར་མཛད་པ་པོ། །དེ་ནི་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་དགུ་བཅུ་དྲུག་གནས་ཤིང་། །
en: And after this buddha who benefits the world Has attained nirvāṇa, “His sacred Dharma will remain ninety-six thousand years

source: མཆོད་རྟེན་དབྱེར་མེད་པ་ནི་གཅིག་ཅིག་འབྱུང་། །
en: And there will be a single, unfragmented stūpa.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འབྱུང་གནས་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་མེ་ཏོག་ལྡན་ཞེས་བྱ། །
en: The buddha Dharmākara will be born In a place called Endowed with Flowers.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་གཉིས་ཡོད་བསོད་ནམས་བཟང་པོ་ཡབ། །བསོད་ནམས་ལྡན་པ་ཡུམ་ཡིན་སྲས་པོ་ནི། །སཱ་ལའི་དྲི་ལྡན་བྱང་ཆུབ་རིམ་གྲོ་པ། །
en: “His family will be kṣatriya, And his light will extend twenty-two leagues. Excellent Merit will be his father and Endowed with Merit his mother. Endowed with Śāla Fragrance will be his son and Awakening his attendant.

source: སྨྲ་བ་འཇོམས་བྱེད་ཅེས་བྱ་མཁས་པ་སྟེ། །
en: “Speech Conqueror will be the scholar

source: བརྟུལ་ཞུགས་བརྟན་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Steadfast Yogic Discipline the one of miracles.

source: འདུས་པ་དང་པོར་གང་དག་དགྲ་བཅོམ་པ། །བྱེ་བ་དགུ་བཅུ་རྩ་བཞི་ཐམ་པ་ཡོད། །གཉིས་པར་གསུམ་ཡོད་གསུམ་པར་བཞི་ཡོད་དོ། །
en: In the first congregation nine hundred forty million Worthy ones will gather. “In the second will be nine hundred thirty, and in the third there will be nine hundred forty.

source: དེ་ཡི་སྐུ་ཚེ་ལོ་གྲངས་བརྒྱད་ཁྲི་ཡིན། །
en: His lifespan will be eighty thousand years,

source: རྒྱལ་བ་མྱ་ངན་འདས་པའི་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་བཅུ་ཡི་བར་དུ་གནས། །
en: And after this victorious one has attained nirvāṇa The sacred Dharma will remain for ten thousand years,

source: མཆོད་རྟེན་བྱེ་བ་དགུ་བཅུ་རྩ་དྲུག་སྟེ། །ཐམས་ཅད་རིན་ཆེན་དྲ་བས་རྣམ་པར་བརྒྱན། །
en: “And there will be nine hundred sixty million stūpas, All adorned with jewel nets.

source: དེ་བཞིན་གཤེགས་པ་ཚིམས་སྦྱིན་སྐྱེ་བའི་ཡུལ། །མེ་ཏོག་རྣམ་པར་བརྒྱན་ཞེས་བྱ་བ་ཡིན། །
en: The buddha Harṣadatta will be born In a place called Adorned with Flowers.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཁྲི་བརྒྱ་སུམ་ཅུ་གཉིས་ཡོད་ལེགས་སྐྱེས་ཡབ། །སཱ་ལའི་འོད་ཅེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “His family will be kṣatriya, And his light will extend thirty-two million leagues. Excellent Birth will be his father and Śāla Light his mother.

source: སྲས་པོ་ལེགས་ལྡན་འོད་འཕྲོ་རིམ་གྲོ་པ། །
en: Endowed with Excellence will be his son and Radiant his attendant.

source: དཔལ་རྒྱལ་ཞེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: “Glorious Victor will be the scholar

source: འོད་བྱེད་སྦྱིན་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Light Gift the one of miracles.

source: འདུས་པ་དང་པོར་སྐྱེ་བ་འཇོམས་བྱེད་པ། །དགྲ་བཅོམ་སྟོང་ཕྲག་སུམ་ཅུ་རྩ་གཉིས་ཡོད། །འདུས་པ་གཉིས་པར་ཉི་ཤུ་རྩ་དགུ་ཡོད། །གསུམ་པར་ཉི་ཤུ་རྩ་བརྒྱད་ཐམ་པ་ཡོད། །
en: In the first congregation thirty-two thousand Worthy ones who have vanquished birth will gather. “In the second gathering will be twenty-nine thousand, And in the third there will be twenty-eight thousand.

source: དེ་ན་མི་རྣམས་དག་གི་ཚེ་ཡི་ཚད། །ལོ་གྲངས་སྟོང་ཕྲག་ཉི་ཤུ་རྩ་གཉིས་ཡིན། །
en: The lifespan of human beings Will be twenty-two thousand years,

source: མྱ་ངན་འདས་ནས་དམ་ཆོས་སུམ་འགྱུར་གནས། །
en: “And upon attaining nirvāṇa the sacred Dharma will remain thrice as long.

source: བདེ་གཤེགས་སྐུ་གདུང་རིལ་གཅིག་མཆོད་རྟེན་གཅིག །
en: There will be a single relic and a single stūpa of this well-gone one.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འབྱུང་གནས་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་ཟླ་བ་ཅན་ཞེས་བྱ། །
en: The buddha Ratnākara will be born In a place called Moon Bearer.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གཉིས་ཡོད་ཡབ་ནི་མྱ་ངན་མེད། །བསོད་ནམས་ལྡན་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “His family will be brahmin, And his light will extend two leagues. Free from Suffering will be his father and Endowed with Merit his mother.

source: སྲས་པོ་ལེགས་མཐོང་མཆོག་མ་རིམ་གྲོ་པ། །
en: Excellent Sight will be his son and Supreme his attendant.

source: བློ་སྦྱིན་ཞེས་བྱ་ཤེས་རབ་གཙོ་བོ་སྟེ། །
en: “Wisdom Gift will be the scholar

source: སེང་གེ་དགའ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Lion Joy the one of miracles.

source: འདུས་པ་དང་པོར་སྐྱེ་རྒ་འཆི་བ་དག །མཐར་བྱེད་བྱེ་བ་བརྒྱ་ཕྲག་དགུ་བཅུ་ཡོད། །འདུས་པ་གཉིས་པར་དགུ་བཅུ་རྩ་ལྔ་ཡོད། །གསུམ་པར་ཚོགས་པ་དགུ་བཅུ་རྩ་དྲུག་ཐམ། །
en: In the first congregation will gather ninety billion Liberators from birth, aging, and death. “In the second gathering will be ninety-five billion And in the third there will be ninety-six billion.

source: མི་རྣམས་དག་གི་ཚེ་ཚད་ལོ་བརྒྱ་ཡིན། །
en: The lifespan of human beings will be one hundred years,

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་བདུན་ཅུའི་བར་དུ་གནས། །
en: And upon attaining parinirvāṇa “The sacred Dharma will remain for seventy thousand years.

source: དེ་ཡི་མཆོད་རྟེན་དཔག་ཚད་གཅིག་པ་གཅིག །
en: There will be a single stūpa, measuring one league.

source: དེ་བཞིན་གཤེགས་པ་སྐྱེ་དབང་མཚུངས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་རྣམ་པར་བལྟས་ཞེས་བྱ། །
en: The thus-gone Janendrakalpa will be born In a place called Sight.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་སུམ་ཅུ་ཡབ་ནི་སྤོས་བཟངས་ཡིན། །རིན་ཆེན་ལྡན་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “His family will be brahmin, And his light will extend thirty leagues. Fine Incense will be his father and Possessor of Jewels his mother.

source: སྲས་པོ་སྡུག་དགའ་འདུན་པ་རིམ་གྲོ་པ། །
en: Joyous Beauty will be his son and Aspiration his attendant.

source: རྒྱ་མཚོའི་བློ་ཞེས་བྱ་བ་ཤེས་རབ་ཆེ། །
en: “Ocean Mind will be the one of great insight

source: དང་པོར་ཚོགས་པ་ཐེར་འབུམ་དགུ་བཅུ་ཡོད། །བར་མ་གཉིས་པར་ཚོགས་པ་བརྒྱད་ཅུ་བརྒྱད། །ཐ་མར་ཐེར་འབུམ་བརྒྱད་ཅུ་རྩ་དྲུག་ཡོད། །
en: In the first congregation there will be ninety billion, In the second there will be eighty-eight billion, “And in the third there will be eighty-six billion.

source: དེ་དག་ཚེ་ཚད་ལོ་གྲངས་སྟོང་ཕྲག་བརྒྱ། །དམ་ཆོས་ལོ་གྲངས་བྱེ་བ་བཅུར་ཡང་གནས། །
en: The lifespan of human beings will be one hundred thousand years, And the sacred Dharma will remain for a hundred million years.

source: མཆོད་རྟེན་བྱེ་བ་དགུ་བཅུ་རྩ་བརྒྱད་དེ། །རིན་ཆེན་རྒྱལ་མཚན་གདུགས་དང་འཕན་གྱིས་བརྒྱན། །མཆོད་རྟེན་རེ་རེའང་གདུགས་ནི་བྱེ་བ་ཡོད། །
en: There will be nine hundred eighty million stūpas “Adorned with banners, parasols, and crests. For each stūpa there will be ten million parasols.

source: དེ་བཞིན་གཤེགས་པ་སྟབས་ཀྱིས་གཤེགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མེ་ཏོག་འོད་ཅེས་བྱ། །
en: The thus-gone Vikrāntagāmin will be born In a place called Flower Light.

source: རིགས་ནི་བྲམ་ཟེ་འོད་ཟེར་དྲ་བའི་ཚད། །དཔག་ཚད་ཉི་ཤུ་གཉིས་ཡོད་རི་དབང་ཡབ། །རྒྱལ་དེའི་ཡུམ་ནི་དགའ་བ་ཞེས་ཀྱང་བྱ། །
en: “His family will be brahmin, And the net of his radiance will reach twenty-two leagues. Majestic Mountain will be the father of this victor; Joy will be his mother.

source: དེ་ཡི་སྲས་པོ་ཡོན་ཏན་སེམས་ཞེས་བྱ། །
en: Mind of Excellent Qualities will be his son;

source: སྲིད་པའི་བཤེས་གཉེན་དེ་ཡི་རིམ་གྲོ་པ། །
en: “Friend of Existence will be his attendant.

source: ཉེ་སྡེ་ཤེས་ཅན་རྐང་སྟོབས་རྫུ་འཕྲུལ་ཅན། །
en: Close Force will be the one of insight and Strong Support the one of miracles.

source: མི་མཆོག་དེ་ཡི་འདུས་པ་དང་པོར་ནི། །དགྲ་བཅོམ་བརྒྱ་ཕྲག་སུམ་ཅུ་རྩ་གཉིས་ཡོད། །
en: In the first congregation of this supreme human Will be three thousand two hundred worthy ones.

source: གཉིས་པར་བརྒྱ་ཕྲག་སུམ་ཅུ་རྩ་གསུམ་ཡོད། །གསུམ་པར་ཚོགས་པ་ཕལ་ཆེར་ཐེར་འབུམ་ཡོད། །
en: “In the second will be three thousand three hundred. In the great third assembly there will be one billion.

source: མི་ཡི་འདྲེན་པ་དེ་ཡི་སྐུ་ཚེའི་ཚད། །ལོ་གྲངས་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་བཞི་ཡིན། །
en: The lifespan of this guide of humans Will be ninety-four thousand years,

source: དེ་ཚེ་དེ་ཡི་སུམ་འགྱུར་དམ་ཆོས་གནས། །
en: “And the sacred Dharma will remain thrice as long.

source: དེ་ཚེ་སྐུ་གདུང་རིལ་གཅིག་མཆོད་རྟེན་གཅིག །
en: The relics will remain in a single collection within a single stūpa.

source: འཇིག་རྟེན་རྣམ་པར་འདྲེན་པ་བློ་གནས་ཀྱི། །སྐྱེ་ཡུལ་རིན་ཆེན་གཟི་བརྗིད་དགའ་ཞེས་བྱ། །རིགས་ནི་རྒྱལ་རིགས་འོད་ནི་དཔག་ཚད་གཅིག །བསོད་ནམས་དཔལ་ཡབ་དགའ་བ་བཟང་མོ་ཡུམ། །
en: The guide of the world, Sthitabuddhi, Will be born in a place called Joy of Splendid Jewels. “His family will be kṣatriya and his light will extend one league. Glorious Merit will be his father and Excellent Joy his mother.

source: སྲས་པོ་ཆུ་ལྷ་དགའ་བ་རིམ་གྲོ་པ། །
en: Water God will be his son and Divine Joy his attendant.

source: བསོད་ནམས་སྒྲོན་ཞེས་བྱ་བ་ཤེས་རབ་ཅན། །
en: Merit Lamp will be the one of insight

source: འབྲུག་སྒྲ་རྫུ་འཕྲུལ་ཅན་གྱི་མཆོག་མ་ཡིན། །
en: “And Sound of Thunder the one of miracles.

source: འདུས་པ་དང་པོར་དགྲ་བཅོམ་བྱེ་བ་བརྒྱ། །འདུས་པ་གཉིས་པར་ཡང་སྲིད་ཟད་པ་དག །བརྒྱད་ཅུ་གསུམ་པར་དྲུག་ཅུ་འབྱུང་བར་འགྱུར། །
en: In the first congregation there will be one billion worthy ones. In the second there will be eight hundred million who have exhausted existence, And in the third there will be six hundred million.

source: དེ་ན་མི་དེ་དག་གི་ཚེ་ཡི་ཚད། །ལོ་གྲངས་སྟོང་ཕྲག་ཉི་ཤུ་རྩ་བཞི་ཡིན། །
en: The lifespan of human beings at that time Will be twenty-four thousand years,

source: མྱ་ངན་འདས་ནས་དེ་ན་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་ལྔ་བརྒྱའི་བར་དུ་གནས། །
en: And upon attaining nirvāṇa The sacred Dharma will remain for five hundred thousand years.

source: མཆོད་རྟེན་བྱེ་བ་བརྒྱ་ཕྲག་ལྔ་ཡོད་དེ། །ཐམས་ཅད་རིན་ཆེན་གདུགས་ཀྱིས་མཛེས་ཁེབས་བྱས། །
en: “There will be five billion stūpas, All adorned with beautiful jewel parasols.

source: དེ་བཞིན་གཤེགས་པ་གདུགས་མཛེས་པ་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་རིན་ཆེན་ཕུང་པོ་ཡིན། །
en: The thus-gone one, Vibhrājacchattra, Will be born in a place called Heap of Jewels.

source: རིགས་ནི་རྒྱལ་རིགས་འོད་གཟི་དཔག་ཚད་ནི། །བྱེ་བ་ཐམ་པ་ཡབ་ནི་སྒྲ་གཅན་ལྷ། །མེ་ཏོག་ཅན་ཞེས་བྱ་བ་དེ་ཡི་ཡུམ། །
en: “His family will be kṣatriya, And his splendid light will extend ten million leagues. Sound Bearer God will be his father and Endowed with Flowers his mother.

source: དེའི་སྲས་རྒྱལ་བ་བློ་བཟངས་རིམ་གྲོ་པ། །
en: Conqueror will be his son and Excellent Mind his attendant.

source: ལྷ་ཡིས་མཆོད་ཅེས་བྱ་བ་ཤེས་རབ་ཅན། །
en: “Worshiped by Gods will be the one of insight

source: མ་ག་དྷ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Magadha the one of miracles.

source: དགྲ་བཅོམ་བྱེ་བ་བརྒྱ་ཕྲག་སུམ་ཅུ་གསུམ། །གཉིས་པར་ཆགས་མེད་སུམ་ཅུ་རྩ་གཉིས་ཡོད། །གསུམ་པར་ཟད་མེད་སུམ་ཅུ་རྩ་གཅིག་ཡོད། །
en: Thirty-three billion worthy ones will gather. The second time there will be thirty-two billion free from attachment, “And the third time, thirty-one billion who have passed beyond exhaustion.

source: མི་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ། །
en: The lifespan of human beings will be twenty-five thousand years

source: འཇིག་རྟེན་རྣམ་འདྲེན་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་པའི་ཆོས་དག་ལོ་གྲངས་བྱེ་བར་གནས། །
en: And after this guide has attained nirvāṇa, The sacred Dharma will remain for ten million years.

source: མཆོད་རྟེན་དཔག་ཚད་ཕྱེད་པ་བྱེ་བ་ཕྲག །བརྒྱད་ཅུ་རིན་ཆེན་བདུན་ཡིན་རྒྱས་པར་འགྱུར། །
en: “There will be eight hundred million stūpas the size of half a league, All adorned with the seven precious substances.

source: འཇིག་རྟེན་དག་གི་མགོན་པོ་གཙོ་བོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་ལྡན་ཞེས་བྱ། །
en: The protector of the world, Jyeṣṭha, Will be born in a place called Endowed with Merit.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་གཉིས་ཡོད་ཡབ་ནི་ཟླ་བཟངས་ཡིན། །དེ་ཡི་ཡུམ་ནི་མེ་ཏོག་བསགས་ཞེས་བྱ། །
en: “The family of this victorious one will be kṣatriya, And his light will extend two leagues. Excellent Moon will be his father and Gathered Flowers his mother.

source: སྲས་པོ་མཛེས་པ་དཔལ་ཅན་རིམ་གྲོ་པ། །
en: Beauty will be his son and Glorious his attendant.

source: བློ་སྦྱངས་ཞེས་ནི་བྱ་བ་ཤེས་རབ་ཅན། །
en: “Trained Mind will be the one of insight

source: མཐའ་ཡས་དཔལ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Infinite Glory the one of miracles.

source: འདུས་པ་དང་པོར་དབང་དུ་གྱུར་པ་རྣམས། །སྟོང་ཕྲག་བརྒྱད་ཅུ་གཉིས་པར་དགུ་བཅུ་ཡོད། །གསུམ་པར་དྲི་མ་མེད་པ་བྱེ་བ་བརྒྱ། །
en: In the first congregation eighty thousand powerful ones will be gathered; In the second there will be ninety thousand; “And in the third there will be one billion stainless ones.

source: སྐུ་ཚེ་ལོ་གྲངས་བྱེ་བ་གཉིས་ཀྱང་ཡིན། །དམ་ཆོས་ལོ་གྲངས་བྱེ་བ་བཅུར་ཡང་གནས། །
en: His lifespan will be twenty million years And the sacred Dharma will remain for one hundred million years.

source: རྒྱང་གྲགས་སུམ་ཅུ་པ་ཡི་མཆོད་རྟེན་གཅིག །རིན་ཆེན་བདུན་པོ་དག་གིས་དེ་རྒྱས་ཤིང་། །གདུགས་གྲངས་བྱེ་བ་བརྒྱ་ཕྲག་བདུན་ཅུ་གཉིས། །
en: There will be a single stūpa, measuring thirty krośas. “It will be abundantly adorned with the seven precious substances And seventy-two billion parasols.

source: བདེ་བར་གཤེགས་པ་ཤིན་ཏུ་འཕགས་དཔལ་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་ཡེ་ཤེས་ལྡན་ཞེས་བྱ། །
en: The well-gone Abhyudgataśrī will be born In a place called Endowed with Wisdom.

source: བདེ་གཤེགས་དེའི་རིགས་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །རྒྱང་གྲགས་བཅུ་ཡོད་བཤེས་གཉེན་བཟང་པོ་ཡབ། །སྐྱེ་བོའི་མཆོད་རྟེན་ཞེས་བྱ་སྐྱེད་པའི་ཡུམ། །
en: “The family of this well-gone one will be brahmin And his light will extend ten krośas. Excellent Friend will be his father and Stūpa for Humanity his mother.

source: སྲས་པོ་མཆོག་མ་མིག་བཟངས་རིམ་གྲོ་པ། །
en: Supreme will be his son and Excellent Eye his attendant.

source: སེང་གེའི་སྒྲ་སྒྲོགས་པ་ནི་མཁས་པ་སྟེ། །
en: “Roaring like a Lion will be the one of insight

source: བླ་མ་ཞེས་ནི་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Highest the one of miracles.

source: འདུས་པ་དང་པོར་དགྲ་བཅོམ་བྱེ་ཕྲག་བཅུ། །གཉིས་པར་བཅུ་གཉིས་གསུམ་པར་བརྒྱད་ཡོད་དོ། །
en: In the first congregation there will be one hundred million worthy ones, In the second there will be one hundred twenty million, and in the third there will be eighty million.

source: དེ་ན་མི་རྣམས་དག་གི་ཚེ་ཡི་ཚད། །ལོ་གྲངས་སྟོང་ཕྲག་ཉི་ཤུ་རྩ་བཞི་ཡིན། །
en: “The lifespan of humans at that time Will be twenty-four thousand years.

source: རྒྱལ་བ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་བྱེ་བར་གནས་ཤིང་སྐུ་གདུང་འཕེལ། །མཆོད་རྟེན་བྱེ་བ་བརྒྱ་ཕྲག་དགུ་ཡོད་དེ། །ཐམས་ཅད་རྒྱང་གྲགས་བདུན་པ་རིན་ཆེན་གདུགས། །
en: After the victorious one has attained nirvāṇa The sacred Dharma will remain for ten million years. “His relics will increase and there will be nine billion stūpas, Each measuring seven krośas and adorned with jewel parasols.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་སྒྲ་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་སཱ་ལའི་བདག་ཅེས་བྱ། །
en: The thus-gone Siṃhaghoṣa will be born In a place called Lord of Śāla Trees.

source: བདེ་གཤེགས་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །རྒྱང་གྲགས་དགུ་ཡོད་ཡབ་ནི་ལུས་མཛེས་ཡིན། །སྨྲ་བ་གྲུབ་ཅེས་བྱ་བ་དེ་ཡི་ཡུམ། །
en: “The family of this well-gone one will be kṣatriya, And his light will extend nine krośas. Beautiful Body will be his father and Accomplished Speech his mother.

source: སྲས་པོ་ནད་མེད་ཏོག་ནི་རིམ་གྲོ་པ། །
en: Free from Disease will be his son and Crest his attendant.

source: ཤེས་རབ་གདོན་མི་ཟ་བ་མཁས་པ་སྟེ། །
en: “Insight Free from Doubt will be the scholar

source: ཆོས་དགའ་ཞེས་ནི་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Dharma Joy the one of miracles.

source: དང་པོར་ཚོགས་པ་སྟོང་ཕྲག་དྲུག་ཅུ་ཡོད། །གཉིས་པར་བདུན་ཅུ་གསུམ་པར་བརྒྱད་ཅུ་ཡོད། །དགྲ་བཅོམ་ཀུན་ཀྱང་ང་རྒྱལ་དྲེགས་ལས་གྲོལ། །
en: In the first congregation there will be sixty thousand Worthy ones who are free from pride and arrogance. “In the second will be seventy thousand, and in the third there will be eighty thousand.

source: སྐུ་ཚེ་རིང་སྟེ་ལོ་གྲངས་སྟོང་ཕྲག་བཅུ། །
en: The span of his life will be long: ten thousand years.

source: རྡུལ་དང་རྣམ་བྲལ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་པའི་ཆོས་དག་ལོ་གྲངས་སྟོང་དུ་གནས། །
en: After this immaculate one has attained nirvāṇa, The sacred Dharma will remain for a thousand years.

source: དེ་ཚེ་བདེ་བར་གཤེགས་པའི་མཆོད་རྟེན་གཅིག །དཔག་ཚད་བདུན་ཙམ་ཁོར་ཡུག་རིན་ཆེན་གང་། །
en: “At that time there will be a single stūpa of this well-gone one, Measuring seven leagues and studded with jewels throughout.

source: བདེ་བར་གཤེགས་པ་རྣམ་རོལ་ལྡན་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་དཔལ་ཞེས་བྱ། །
en: The well-gone Vikrīḍitāvin will be born In a place called Glorious Merit.

source: བདེ་གཤེགས་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །རྒྱང་གྲགས་གསུམ་ཡོད་གཟི་བརྗིད་བཟང་པོ་ཡབ། །བསོད་ནམས་ང་རོ་ཞེས་བྱ་ཡུམ་ཡིན་ནོ། །
en: “The family of this well-gone one will be brahmin And his light will extend three krośas. Excellent Splendor will be his father and Roar of Merit his mother.

source: སྲས་པོ་ལྷ་སྡུག་ཞི་བ་རིམ་གྲོ་པ། །
en: Loved by the Gods will be his son and Peace his attendant.

source: སྨྲ་བའི་མཆོག་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Supreme Teacher the one of miracles.

source: འདུས་པ་དང་པོར་འདོད་ཆགས་རྡུལ་རྣམས་ནི། །མ་ལུས་བཅོམ་པ་སྟོང་ཕྲག་བརྒྱད་ཅུ་ཡོད། །འདུས་པ་གཉིས་པར་བདུན་ཅུ་རྩ་བརྒྱད་ཡོད། །གསུམ་པར་གཏི་མུག་སྤངས་པ་བདུན་ཅུ་དྲུག །
en: In the first congregation there will be eighty thousand Who have completely vanquished the dirt of desire. “In the second congregation will be seventy-eight thousand, And in the third there will be seventy-six thousand who have given up dullness.

source: དེ་ཚེ་མི་རྣམས་དག་གི་ཚེ་ཡི་ཚད། །ལོ་གྲངས་སྟོང་ཕྲག་བདུན་ཅུ་རྩ་བཞི་ཡིན། །
en: The lifespan of humans at that time Will be seventy-four thousand years,

source: ཉིས་འགྱུར་དག་ཏུ་དེ་ཡི་དམ་ཆོས་གནས། །
en: “And the sacred Dharma will remain twice as long.

source: དྲང་སྲོང་ཆེན་པོའི་མཆོད་རྟེན་གཅིག་ཅིག་འབྱུང་། །
en: There will be a single stūpa of this great sage.

source: དེ་བཞིན་གཤེགས་པ་ཀླུ་ཡི་འོད་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་གླང་པོས་མཐོང་ཞེས་བྱ། །
en: The thus-gone Nāgaprabhāsa will be born In a place called Seen by Elephants.

source: དེའི་རིགས་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བདུན་ཅུ་ཡབ་ནི་ཡུལ་འཁོར་བཟང་། །ཤིན་ཏུ་དགའ་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “His family will be kṣatriya, And his light will extend seventy leagues. Land of Excellence will be his father and Intense Joy his mother.

source: སྲས་པོ་འཕན་བྱེད་ལྷུན་པོ་རིམ་གྲོ་པ། །
en: Benefactor will be his son and Mountain his attendant.

source: རྒྱུ་ཡི་སྟོབས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Causal Strength will be the scholar

source: དྲང་སྲོང་བྱིན་དགའ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Given by the Sages the one of miracles.

source: འདུས་པ་དང་པོར་རྒྱལ་བའི་དགྲ་བཅོམ་པ། །ཚོགས་པ་བྱེ་བ་སྟོང་ཕྲག་བདུན་ཅུ་གཉིས། །གཉིས་པ་དག་ཏུ་བདུན་ཅུ་རྩ་གཅིག་ཡོད། །གསུམ་པར་བྱེ་བ་སྟོང་ཕྲག་བདུན་ཅུ་ཡོད། །
en: Seven hundred twenty billion victorious worthy ones Will gather in the first assembly. “In the second congregation will be seven hundred ten billion, And in the third there will be seven hundred billion.

source: དེ་ཚེ་སྐད་ཅིག་དེ་ལ་སྐུ་ཚེའི་ཚད། །ལོ་གྲངས་བརྒྱད་བརྒྱའི་བར་དུ་གནས་པར་འགྱུར། །
en: At that time the duration of life Will be eight hundred years.

source: དམ་ཆོས་ལོ་གྲངས་བརྒྱ་ཕྲག་བཅུ་གཉིས་གནས། །
en: “The sacred Dharma will remain twelve hundred years

source: རྒྱལ་བའི་མཆོད་རྟེན་གཅིག་ཅིག་འབྱུང་བར་འགྱུར། །
en: And there will be a single stūpa of this victorious one.

source: དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་རི་བོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་རི་ཡིས་མཐོང་ཞེས་བྱ། །
en: The thus-gone Kusumaparvata will be born In a place called Seen by Mountains.

source: རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་དཀྱིལ་འཁོར་དག །དཔག་ཚད་སུམ་ཅུ་ཡབ་ནི་ལེགས་ཡིད་གཞུངས། །ཡོན་ཏན་བསགས་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “His family will be brahmin, And the circle of his light will extend thirty leagues. Fine and Noble Mind will be his father and Qualities Accumulated his mother.

source: སྲས་པོ་བདེ་སྟོབས་དྲག་ཤུལ་རིམ་གྲོ་པ། །
en: Strength of Bliss will be his son and Fierce his attendant.

source: བློ་རྫོགས་འོད་ཟེར་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Radiance of Perfect Wisdom will be the scholar

source: གློག་མཆོག་ཅེས་བྱ་བ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Supreme Lightning the one of miracles.

source: དགྲ་བཅོམ་འདུས་པ་སྟོང་ཕྲག་དྲུག་ཅུ་དྲུག །གཉིས་པར་རྡུལ་མེད་དྲུག་ཅུ་རྩ་ཡང་ལྔ། །གསུམ་པར་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བཞི་ཡོད། །
en: The gathering of worthy ones will number sixty-six thousand. In the second congregation will be sixty-five thousand immaculate ones, “And in the third there will be sixty-four thousand.

source: བདེ་བར་གཤེགས་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་བྱེ་བ་གསུམ་དུ་གནས། །
en: After this well-gone one has attained nirvāṇa The sacred Dharma will remain thirty million years.

source: རྒྱལ་བའི་མཆོད་རྟེན་ཁྲི་ཕྲག་བཅུ་ཡོད་དེ། །མུ་ཏིག་དྲ་བ་མཆོག་དག་སྦྱངས་པས་ཁྱབ། །
en: There will be one hundred thousand stūpas of this victorious one, Exquisitely decorated with supreme pearl nets.

source: དེ་བཞིན་གཤེགས་པ་ཀླུ་ནི་དགའ་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མེ་ཏོག་འོད་ཅེས་བྱ། །
en: The thus-gone Nāganandin will be born In a place called Flower Light.

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དྲུག་ཅུ་རྩ་བདུན་འཕྲོས་པར་འགྱུར། །རི་དགས་འགྲོས་ཞེས་བྱ་བ་ཡབ་ཡིན་ལ། །གཟུགས་བཟང་མོ་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “His family will be kṣatriya, And his light will shine across sixty-seven leagues. Deer Gait will be his father And Fine Form his mother.

source: དེ་ཡི་སྲས་པོ་ཀླུ་ཞེས་བྱ་བ་སྟེ། །
en: “Nāga will be his son

source: གླིང་འགྲོ་ཞེས་བྱ་དེ་ཡི་རིམ་གྲོ་པ། །
en: And Continent Traveler his attendant.

source: འགྲོ་བའི་གཟི་བརྗིད་ཅེས་བྱ་མཁས་པ་སྟེ། །
en: Splendor of the World will be the scholar

source: དགའ་ཆེན་ཞེས་ནི་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Great Joy the one of miracles.

source: དང་པོར་ཚོགས་པ་བྱེ་བ་སྟོང་ཕྲག་ཡོད། །གཉིས་པར་བརྒྱད་ཡོད་གསུམ་པ་དག་ཏུ་ལྔ། །
en: “In the first congregation there will be ten billion, In the second there will be eighty million, and in the third there will be fifty million.

source: སྐུ་ཚེ་ལོ་གྲངས་དག་ནི་སུམ་ཁྲི་ཡིན། །དམ་ཆོས་ལོ་གྲངས་སྟོང་ཕྲག་བདུན་ཅུར་གནས། །
en: His lifespan will be thirty thousand years, And the sacred Dharma will remain for seventy thousand years.

source: རྒྱལ་བའི་མཆོད་རྟེན་སྟོང་ཕྲག་བརྒྱད་ཅུ་སྟེ། །རྒྱལ་མཚན་མཐོན་པོ་དཔག་ཚད་གཅིག་པས་བརྒྱན། །
en: “There will be eighty thousand stūpas of this victorious one, Adorned with banners that reach a league high.

source: དེ་བཞིན་གཤེགས་པ་སྤོས་ཀྱི་དབང་ཕྱུག་གི། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་བས་མཐོང་ཞེས་བྱ། །
en: The thus-gone Gandheśvara will be born In a place called Seen with Delight.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་སུམ་ཅུ་ཡབ་ནི་ལེགས་སྐྱེས་ཡིན། །ཟླ་འོད་ཡུམ་ཡིན་སྲས་པོ་འཛམ་བུ་འགྲོ། །
en: “His family will be brahmin, And his light will extend thirty leagues. Excellent Birth will be his father, Moonlight his mother, and Jambu Movement his son.

source: ལེགས་གཙོ་ཞེས་ནི་བྱ་བ་རིམ་གྲོ་པ། །
en: Excellent Leader will be his attendant.

source: ཤེས་རབ་འོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Light of Insight will be the scholar

source: དཔལ་དྲེགས་ཞེས་ནི་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Glorious Pride the one of miracles.

source: དང་པོར་དགྲ་བཅོམ་བྱེ་བརྒྱ་དགུ་བཅུ་ཡོད། །གཉིས་པར་བརྒྱད་ཅུ་གསུམ་པར་བདུན་ཅུ་དྲུག །
en: In the first congregation there will be ninety billion worthy ones, In the second there will be eighty billion, and in the third there will be seventy-six billion.

source: དེ་ཚེ་མི་རྣམས་དག་གི་ཚེ་ཡི་ཚད། །ལོ་གྲངས་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་ཡིན། །
en: “At that time the lifespan of humans Will be eighty-four thousand years,

source: དེ་ཡི་དམ་པའི་ཆོས་དག་ལོ་གྲངས་ནི། །འབུམ་ཕྲག་བརྒྱ་ཡི་བར་དུ་གནས་པར་འགྱུར། །
en: And his sacred Dharma Will remain for one million years.

source: མཆོད་རྟེན་བྱེ་བ་སྟོང་ཕྲག་བདུན་ཅུ་གཅིག །གསེར་མཆོག་དམ་པ་དག་གིས་ལེགས་པར་སྤྲས། །
en: “There will be seven hundred ten billion stūpas, Beautifully adorned with the purest and finest gold.

source: བདེ་བར་གཤེགས་པ་ཤིན་ཏུ་གྲགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་དག་པར་དགའ་ཞེས་བྱ། །
en: The well-gone one Atiyaśas will be born In a place called Pure Delight.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ལྔ་ཡོད་ཡབ་ནི་ཚོགས་དབང་ཡིན། །གསེར་ལྡན་མ་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “His family will be kṣatriya, And his light will extend five leagues. Master of the Gathering will be his father and Possessor of Gold will be his mother.

source: སྲས་པོ་སྐལ་འདོད་ཉི་མ་རིམ་གྲོ་པ། །
en: Fortunate Wish will be his son and Sun will be his attendant.

source: ཆོས་འོད་ཅེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: “Dharma Light will be the scholar

source: ཐོས་པ་རྟོགས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Realizing the Heard will be the one of miracles.

source: འདུས་པ་དང་པོ་དག་ཏུ་དགྲ་བཅོམ་པ། །བྱེ་བ་སྟོང་ཕྲག་བཞི་བཅུ་རྩ་དྲུག་ཡོད། །གཉིས་པར་བཞི་བཅུ་རྩ་གསུམ་ཐམ་པ་ཡོད། །གསུམ་པར་ཉི་ཤུ་རྩ་གསུམ་ཐམ་པ་འབྱུང་། །
en: In the first congregation there will be Four hundred sixty billion worthy ones, In the second there will be four hundred thirty billion, And in the third there will be two hundred thirty billion.

source: སྐུ་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་གཉིས་ཀྱང་ཡིན། །
en: His lifespan will be two thousand years,
